01_openfoam_case_iblm/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}

application     coinIBLMSolver;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.2;
deltaT          1e-4;
writeControl    timeStep;
writeInterval   20;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
