01_openfoam_case_iblm/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.1 -0.1 0.0)
    ( 0.1 -0.1 0.0)
    ( 0.1  0.1 0.0)
    (-0.1  0.1 0.0)
    (-0.1 -0.1 0.5)
    ( 0.1 -0.1 0.5)
    ( 0.1  0.1 0.5)
    (-0.1  0.1 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 80) simpleGrading (1 1 1)
);

edges();

boundary
(
    sideWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    top
    {
        type patch;
        faces ((4 5 6 7));
    }
    bottom
    {
        type patch;
        faces ((0 3 2 1));
    }
);
