01_openfoam_case_iblm/constant/coinIBLMProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object coinIBLMProperties;
}

rho [1 -3 0 0 0 0 0] 1000;
nu  [0 2 -1 0 0 0 0] 1e-6;

diameter 0.022;
thickness 0.001;
omega0 (0 0 0);
initialPosePerturbDeg (0.20 -0.15 0.10);
patternHeight 2e-5;
edgeSerrationAmplitude 1e-5;
edgeChamfer 5e-5;
initialFluidPerturbation 1e-4;
