01_openfoam_case_iblm/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    location "0";
    object U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    sideWalls { type fixedValue; value uniform (0 0 0); }
    top       { type zeroGradient; }
    bottom    { type zeroGradient; }
}
