01_openfoam_case_iblm/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    sideWalls { type zeroGradient; }
    top       { type fixedValue; value uniform 0; }
    bottom    { type zeroGradient; }
}
