01_openfoam_case_iblm/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object fvSolution;
}

solvers
{
    p
    {
        solver GAMG;
        tolerance 1e-8;
        relTol 0.05;
        smoother DIC;
    }
    U
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-7;
        relTol 0.1;
    }
}

PISO
{
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
}
